УНФ_ТЕСТ/src/Catalogs/КП_ЦветаЭлементов/КП_ЦветаЭлементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ЦветаЭлементов</name>
  <attributes>
    <name>Red</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Green</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Blue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_ЦветаЭлементов/ManagerModule.bsl
Процедура ЗаполнитьОсновныеЦвета() Экспорт
	
	СоздатьОбновитьЦвет("Черный", 0,0,0);
	
	СоздатьОбновитьЦвет("Синий",0,0,255);		
	СоздатьОбновитьЦвет("Фуксия",255,0,255);
	СоздатьОбновитьЦвет("Серый",128, 128,128);
	СоздатьОбновитьЦвет("Зелёный",0, 128, 0);
	СоздатьОбновитьЦвет("Салатовый",153, 255,153);
	СоздатьОбновитьЦвет("Зеленый чай",208, 240,192);
	СоздатьОбновитьЦвет("Лайм",0,255,0);
	СоздатьОбновитьЦвет("Трава",42,174,42);
	СоздатьОбновитьЦвет("Бордовый",128,0,0);
	СоздатьОбновитьЦвет("Нави",0,0,128);
	СоздатьОбновитьЦвет("Оливковый",128,128,0);
	СоздатьОбновитьЦвет("Светло-песочный",252,231,159);
	СоздатьОбновитьЦвет("Желто-персиковый",250,223,173);
	СоздатьОбновитьЦвет("Персиковый",255,229,180);
	СоздатьОбновитьЦвет("Аква", 0, 255, 255);
	СоздатьОбновитьЦвет("Пурпурный",128,0,128);
	СоздатьОбновитьЦвет("Красный",255,0,0);
	СоздатьОбновитьЦвет("Бисквитный",255,219,189);
	СоздатьОбновитьЦвет("Побег папайи",255,239,213);
	СоздатьОбновитьЦвет("Бирюзовый",0,128,128);
	СоздатьОбновитьЦвет("Светло-синий",156,177,240);
	СоздатьОбновитьЦвет("Небесная лазурь",227,243,255);
	СоздатьОбновитьЦвет("Золотой",212,175,55);
	СоздатьОбновитьЦвет("Фиолетовый",208,32,144);
	
	СоздатьОбновитьЦвет("Белый",255,255,255);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура СоздатьОбновитьЦвет(ИмяЦвета, Красный, Зеленый, Синий) Экспорт
	
	СпрСсылка=Справочники.КП_ЦветаЭлементов.НайтиПоНаименованию(ИмяЦвета);
	
	Если СпрСсылка.Пустая() Тогда
		СпрОбъект=Справочники.КП_ЦветаЭлементов.СоздатьЭлемент();
		СпрОбъект.Наименование=ИмяЦвета;
	Иначе
		СпрОбъект=СпрСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	СпрОбъект.Red=Красный;
	СпрОбъект.Green=Зеленый;
	СпрОбъект.Blue=Синий;
	
	Попытка
		СпрОбъект.Записать();
	Исключение
		КП_ОбщееСервер.ЗаписатьОшибку(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
